###################################################################

# Created by write_sdc on Fri Sep 13 21:48:50 2024

###################################################################
set sdc_version 2.0

set_units -time ns -resistance 1.000000e+04kOhm -capacitance 1.000000e-04pF    \
-voltage V -current uA
set_wire_load_mode top
set_wire_load_model -name 50x50 -library lsi_10k
set_max_area 0
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports clk_i]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports rstn_i]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[31]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[30]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[29]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[28]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[27]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[26]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[25]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[24]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[23]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[22]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[21]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[20]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[19]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[18]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[17]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[16]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[15]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[14]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[13]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[12]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[11]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[10]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[9]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[8]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[7]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[6]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[5]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[4]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[3]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[2]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[1]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {insn_i[0]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[31]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[30]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[29]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[28]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[27]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[26]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[25]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[24]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[23]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[22]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[21]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[20]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[19]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[18]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[17]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[16]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[15]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[14]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[13]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[12]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[11]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[10]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[9]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[8]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[7]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[6]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[5]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[4]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[3]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[2]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[1]}]
set_driving_cell -lib_cell FD1 -pin Q -no_design_rule [get_ports {data_i[0]}]
set_load -pin_load 2 [get_ports {pc_o[31]}]
set_load -pin_load 2 [get_ports {pc_o[30]}]
set_load -pin_load 2 [get_ports {pc_o[29]}]
set_load -pin_load 2 [get_ports {pc_o[28]}]
set_load -pin_load 2 [get_ports {pc_o[27]}]
set_load -pin_load 2 [get_ports {pc_o[26]}]
set_load -pin_load 2 [get_ports {pc_o[25]}]
set_load -pin_load 2 [get_ports {pc_o[24]}]
set_load -pin_load 2 [get_ports {pc_o[23]}]
set_load -pin_load 2 [get_ports {pc_o[22]}]
set_load -pin_load 2 [get_ports {pc_o[21]}]
set_load -pin_load 2 [get_ports {pc_o[20]}]
set_load -pin_load 2 [get_ports {pc_o[19]}]
set_load -pin_load 2 [get_ports {pc_o[18]}]
set_load -pin_load 2 [get_ports {pc_o[17]}]
set_load -pin_load 2 [get_ports {pc_o[16]}]
set_load -pin_load 2 [get_ports {pc_o[15]}]
set_load -pin_load 2 [get_ports {pc_o[14]}]
set_load -pin_load 2 [get_ports {pc_o[13]}]
set_load -pin_load 2 [get_ports {pc_o[12]}]
set_load -pin_load 2 [get_ports {pc_o[11]}]
set_load -pin_load 2 [get_ports {pc_o[10]}]
set_load -pin_load 2 [get_ports {pc_o[9]}]
set_load -pin_load 2 [get_ports {pc_o[8]}]
set_load -pin_load 2 [get_ports {pc_o[7]}]
set_load -pin_load 2 [get_ports {pc_o[6]}]
set_load -pin_load 2 [get_ports {pc_o[5]}]
set_load -pin_load 2 [get_ports {pc_o[4]}]
set_load -pin_load 2 [get_ports {pc_o[3]}]
set_load -pin_load 2 [get_ports {pc_o[2]}]
set_load -pin_load 2 [get_ports {pc_o[1]}]
set_load -pin_load 2 [get_ports {pc_o[0]}]
set_load -pin_load 2 [get_ports {data_o[31]}]
set_load -pin_load 2 [get_ports {data_o[30]}]
set_load -pin_load 2 [get_ports {data_o[29]}]
set_load -pin_load 2 [get_ports {data_o[28]}]
set_load -pin_load 2 [get_ports {data_o[27]}]
set_load -pin_load 2 [get_ports {data_o[26]}]
set_load -pin_load 2 [get_ports {data_o[25]}]
set_load -pin_load 2 [get_ports {data_o[24]}]
set_load -pin_load 2 [get_ports {data_o[23]}]
set_load -pin_load 2 [get_ports {data_o[22]}]
set_load -pin_load 2 [get_ports {data_o[21]}]
set_load -pin_load 2 [get_ports {data_o[20]}]
set_load -pin_load 2 [get_ports {data_o[19]}]
set_load -pin_load 2 [get_ports {data_o[18]}]
set_load -pin_load 2 [get_ports {data_o[17]}]
set_load -pin_load 2 [get_ports {data_o[16]}]
set_load -pin_load 2 [get_ports {data_o[15]}]
set_load -pin_load 2 [get_ports {data_o[14]}]
set_load -pin_load 2 [get_ports {data_o[13]}]
set_load -pin_load 2 [get_ports {data_o[12]}]
set_load -pin_load 2 [get_ports {data_o[11]}]
set_load -pin_load 2 [get_ports {data_o[10]}]
set_load -pin_load 2 [get_ports {data_o[9]}]
set_load -pin_load 2 [get_ports {data_o[8]}]
set_load -pin_load 2 [get_ports {data_o[7]}]
set_load -pin_load 2 [get_ports {data_o[6]}]
set_load -pin_load 2 [get_ports {data_o[5]}]
set_load -pin_load 2 [get_ports {data_o[4]}]
set_load -pin_load 2 [get_ports {data_o[3]}]
set_load -pin_load 2 [get_ports {data_o[2]}]
set_load -pin_load 2 [get_ports {data_o[1]}]
set_load -pin_load 2 [get_ports {data_o[0]}]
set_load -pin_load 2 [get_ports mem_wr_o]
set_load -pin_load 2 [get_ports {data_addr_o[11]}]
set_load -pin_load 2 [get_ports {data_addr_o[10]}]
set_load -pin_load 2 [get_ports {data_addr_o[9]}]
set_load -pin_load 2 [get_ports {data_addr_o[8]}]
set_load -pin_load 2 [get_ports {data_addr_o[7]}]
set_load -pin_load 2 [get_ports {data_addr_o[6]}]
set_load -pin_load 2 [get_ports {data_addr_o[5]}]
set_load -pin_load 2 [get_ports {data_addr_o[4]}]
set_load -pin_load 2 [get_ports {data_addr_o[3]}]
set_load -pin_load 2 [get_ports {data_addr_o[2]}]
set_load -pin_load 2 [get_ports {data_addr_o[1]}]
set_load -pin_load 2 [get_ports {data_addr_o[0]}]
set_load -pin_load 2 [get_ports ebreak_o]
create_clock [get_ports clk_i]  -name clk  -period 100  -waveform {0 20}
set_clock_latency 2  [get_clocks clk]
set_clock_uncertainty -setup 1.2  [get_clocks clk]
set_clock_uncertainty -hold 0.2  [get_clocks clk]
set_clock_transition -min -fall 0.3 [get_clocks clk]
set_clock_transition -min -rise 0.3 [get_clocks clk]
set_clock_transition -max -fall 0.3 [get_clocks clk]
set_clock_transition -max -rise 0.3 [get_clocks clk]
set_input_delay -clock clk  2  [get_ports clk_i]
set_input_delay -clock clk  2  [get_ports rstn_i]
set_input_delay -clock clk  2  [get_ports {insn_i[31]}]
set_input_delay -clock clk  2  [get_ports {insn_i[30]}]
set_input_delay -clock clk  2  [get_ports {insn_i[29]}]
set_input_delay -clock clk  2  [get_ports {insn_i[28]}]
set_input_delay -clock clk  2  [get_ports {insn_i[27]}]
set_input_delay -clock clk  2  [get_ports {insn_i[26]}]
set_input_delay -clock clk  2  [get_ports {insn_i[25]}]
set_input_delay -clock clk  2  [get_ports {insn_i[24]}]
set_input_delay -clock clk  2  [get_ports {insn_i[23]}]
set_input_delay -clock clk  2  [get_ports {insn_i[22]}]
set_input_delay -clock clk  2  [get_ports {insn_i[21]}]
set_input_delay -clock clk  2  [get_ports {insn_i[20]}]
set_input_delay -clock clk  2  [get_ports {insn_i[19]}]
set_input_delay -clock clk  2  [get_ports {insn_i[18]}]
set_input_delay -clock clk  2  [get_ports {insn_i[17]}]
set_input_delay -clock clk  2  [get_ports {insn_i[16]}]
set_input_delay -clock clk  2  [get_ports {insn_i[15]}]
set_input_delay -clock clk  2  [get_ports {insn_i[14]}]
set_input_delay -clock clk  2  [get_ports {insn_i[13]}]
set_input_delay -clock clk  2  [get_ports {insn_i[12]}]
set_input_delay -clock clk  2  [get_ports {insn_i[11]}]
set_input_delay -clock clk  2  [get_ports {insn_i[10]}]
set_input_delay -clock clk  2  [get_ports {insn_i[9]}]
set_input_delay -clock clk  2  [get_ports {insn_i[8]}]
set_input_delay -clock clk  2  [get_ports {insn_i[7]}]
set_input_delay -clock clk  2  [get_ports {insn_i[6]}]
set_input_delay -clock clk  2  [get_ports {insn_i[5]}]
set_input_delay -clock clk  2  [get_ports {insn_i[4]}]
set_input_delay -clock clk  2  [get_ports {insn_i[3]}]
set_input_delay -clock clk  2  [get_ports {insn_i[2]}]
set_input_delay -clock clk  2  [get_ports {insn_i[1]}]
set_input_delay -clock clk  2  [get_ports {insn_i[0]}]
set_input_delay -clock clk  2  [get_ports {data_i[31]}]
set_input_delay -clock clk  2  [get_ports {data_i[30]}]
set_input_delay -clock clk  2  [get_ports {data_i[29]}]
set_input_delay -clock clk  2  [get_ports {data_i[28]}]
set_input_delay -clock clk  2  [get_ports {data_i[27]}]
set_input_delay -clock clk  2  [get_ports {data_i[26]}]
set_input_delay -clock clk  2  [get_ports {data_i[25]}]
set_input_delay -clock clk  2  [get_ports {data_i[24]}]
set_input_delay -clock clk  2  [get_ports {data_i[23]}]
set_input_delay -clock clk  2  [get_ports {data_i[22]}]
set_input_delay -clock clk  2  [get_ports {data_i[21]}]
set_input_delay -clock clk  2  [get_ports {data_i[20]}]
set_input_delay -clock clk  2  [get_ports {data_i[19]}]
set_input_delay -clock clk  2  [get_ports {data_i[18]}]
set_input_delay -clock clk  2  [get_ports {data_i[17]}]
set_input_delay -clock clk  2  [get_ports {data_i[16]}]
set_input_delay -clock clk  2  [get_ports {data_i[15]}]
set_input_delay -clock clk  2  [get_ports {data_i[14]}]
set_input_delay -clock clk  2  [get_ports {data_i[13]}]
set_input_delay -clock clk  2  [get_ports {data_i[12]}]
set_input_delay -clock clk  2  [get_ports {data_i[11]}]
set_input_delay -clock clk  2  [get_ports {data_i[10]}]
set_input_delay -clock clk  2  [get_ports {data_i[9]}]
set_input_delay -clock clk  2  [get_ports {data_i[8]}]
set_input_delay -clock clk  2  [get_ports {data_i[7]}]
set_input_delay -clock clk  2  [get_ports {data_i[6]}]
set_input_delay -clock clk  2  [get_ports {data_i[5]}]
set_input_delay -clock clk  2  [get_ports {data_i[4]}]
set_input_delay -clock clk  2  [get_ports {data_i[3]}]
set_input_delay -clock clk  2  [get_ports {data_i[2]}]
set_input_delay -clock clk  2  [get_ports {data_i[1]}]
set_input_delay -clock clk  2  [get_ports {data_i[0]}]
